/* Create program described printer file used by PRT RPG program           */
 PGM
    CRTPRTF FILE(LENNONS1/MYPRT) DEVTYPE(*SCS) +
            PAGESIZE(66 133) LPI(6) CPI(10) +
             OVRFLW(60) CTLCHAR(*FCFC) CHLVAL((1 (6))) +
             FONT(*CPI)
 ENDPGM
