**FREE                                                               
// === BASE36ADD prototype ==========================================
dcl-pr BASE36ADD varchar(50);                                        
    theValue varchar(50) const;                                      
end-pr;                                                              