       //============================================================
        Dcl-PR SQLProblem ; // Report SQL Problem
          pDebugMsg      varchar(200) const;
        End-PR;
