**free
// === Prototype for SRV_SQL routines =========================
dcl-pr SQLProblem ; // Report SQL Problem                    
     pDebugMsg      varchar(200) const;                         
end-pr;
// === End of Prototype for SRV_SQL routines ==================
