**free
//=== Prototypes for SRV_RANDOM routines =======================
dcl-pr Rand_Int int(10); 
  p_Low int(10) value;      // lowest value of range
  p_High int(10) value;     // highest value of range
end-pr;
//=== End of SRV_RANDOM prototypes =============================
