       //============================================================
        Dcl-PR SQLProblem ; // Report SQL Problem
          pDebugMsg      varchar(200) value;
        End-PR;
