**FREE
//=== Prototypes for SRV_STR routines ========================
//============================================================
dcl-pr CenterStr varchar(256);
    *n varchar(256) const; // InStr
end-pr;
//=== End of Prototypes forSRV_STR Routines ==================
