**Free
dcl-pr USAdrVal likeds(USAdrValDs) extproc('USADRVAL');
    inAddr likeds(USAdrValDS);
end-pr;
//=== End of USAdrVal Prototype  =====================================
