/* Convenience pgm that creates CUSTNEXT data area in *CUURLIB */
/* This is a really high number that I don't expect in test data */
/* Strictly it should be set to CUSTMAST COUNT(*) + 1            */
             PGM
             DLTDTAARA  DTAARA(CUSTNEXT) 
             MONMSG     MSGID(CPF0000)
             CRTDTAARA  DTAARA(CUSTNEXT) TYPE(*CHAR) LEN(4) +
                          VALUE('EEEE') TEXT('Next alpha-numeric customer number')
             ENDPGM
