PGM

/* Basic test, using a library as the object to report on */
/* Return just a  message.                                */

             DCL        VAR(&MSG) TYPE(*CHAR) LEN(200)

             GETOBJUSR  OBJECT(QSYS/LENNONS2) TYPE(*LIB) MSGFLD(&MSG)
             SNDMSG     MSG(&MSG) TOUSR(*REQUESTER)

             ENDPGM
