PGM
/* Basic test, using a library as the oject of choice. */
/* Return just a file. Message will be blank.          */

             DCL        VAR(&MSG) TYPE(*CHAR) LEN(200)

             GETOBJUSR  OBJECT(QSYS/LENNONS2) TYPE(*LIB) RETMSG(*NO) +
                          RETFILE(*YES)

             SNDMSG     MSG(&MSG) TOUSR(*REQUESTER)
             QRY        FILE(QTEMP/GETOBJUP)

             ENDPGM
