pgm     
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(200)

             GETOBJUSR  OBJECT(lennons1/qclsrc) TYPE(*file) +
                          MSGFLD(&MSG) RETFILE(*YES)

             SNDMSG     MSG(&MSG) TOUSR(*REQUESTER)
             QRY        FILE(QTEMP/GETOBJUP)

             ENDPGM
