             PGM

/* Create a lock and delay. Called by T9ALLOCMNY        */

             ALCOBJ     OBJ((QIWS/QCUSTCDT *FILE *SHRRD)) WAIT(0)
             DLYJOB     DLY(90)
             ENDPGM
