             PGM                                                  
             ALCOBJ     OBJ((QIWS/QCUSTCDT *FILE *SHRRD)) WAIT(0) 
             DLYJOB     DLY(90)                                   
             ENDPGM                                               